import file_operations
import random
from faker import Faker

letters_mapping = {'а': 'а͠', 'б': 'б̋', 'в': 'в͒͠',
                  'г': 'г͒͠', 'д': 'д̋', 'е': 'е͠',
                  'ё': 'ё͒͠', 'ж': 'ж͒', 'з': 'з̋̋͠',
                  'и': 'и', 'й': 'й͒͠', 'к': 'к̋̋',
                  'л': 'л̋͠', 'м': 'м͒͠', 'н': 'н͒',
                  'о': 'о̋', 'п': 'п̋͠', 'р': 'р̋͠',
                  'с': 'с͒', 'т': 'т͒', 'у': 'у͒͠',
                  'ф': 'ф̋̋͠', 'х': 'х͒͠', 'ц': 'ц̋',
                  'ч': 'ч̋͠', 'ш': 'ш͒͠', 'щ': 'щ̋',
                  'ъ': 'ъ̋͠', 'ы': 'ы̋͠', 'ь': 'ь̋',
                  'э': 'э͒͠͠', 'ю': 'ю̋͠', 'я': 'я̋',
                  'А': 'А͠', 'Б': 'Б̋', 'В': 'В͒͠',
                  'Г': 'Г͒͠', 'Д': 'Д̋', 'Е': 'Е',
                  'Ё': 'Ё͒͠', 'Ж': 'Ж͒', 'З': 'З̋̋͠',
                  'И': 'И', 'Й': 'Й͒͠', 'К': 'К̋̋',
                  'Л': 'Л̋͠', 'М': 'М͒͠', 'Н': 'Н͒',
                  'О': 'О̋', 'П': 'П̋͠', 'Р': 'Р̋͠',
                  'С': 'С͒', 'Т': 'Т͒', 'У': 'У͒͠',
                  'Ф': 'Ф̋̋͠', 'Х': 'Х͒͠', 'Ц': 'Ц̋',
                  'Ч': 'Ч̋͠', 'Ш': 'Ш͒͠', 'Щ': 'Щ̋',
                  'Ъ': 'Ъ̋͠', 'Ы': 'Ы̋͠', 'Ь': 'Ь̋',
                  'Э': 'Э͒͠͠', 'Ю': 'Ю̋͠', 'Я': 'Я̋',
                  ' ': ' '}

#char = "р"
#letter_t = letters_mapping[char]

#print(letter_t)

skill = "Стремительный прыжок"

for letter in skill:
    Letters = letters_mapping[letter]
    print(Letters)
